//=============================================================================
//
// メイン処理 [light.h]
// Author : 有馬武志
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"

//*************************************************************************************************************************
// マクロ定義
//*************************************************************************************************************************
#define MAX_LIGHT		(3)			//ライトの最大数

//=====================
//	   基本クラス
//=====================
class CLight
{
public://誰でも扱える
	CLight();
	~CLight();
	HRESULT Init(HINSTANCE hInstance, HWND hWnd);
	void Uninit(void);
	void Update(void);
protected://個人でのみ使う
	D3DLIGHT9 m_Light[MAX_LIGHT];		//ライトの情報
};

#endif