//=============================================================================
//
// ランキングの処理 [ranking.cpp]
// Author : shun yokomichi
//
//=============================================================================
#include "ranking.h"
#include "main.h"
#include "renderer.h"
#include "manager.h"
#include "input.h"
#include "fade.h"
#include "sound.h"
#include "select.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// 静的メンバ変数
//*****************************************************************************
int				 CRanking::m_nNum = MAX_RANKING;

//=============================================================================
// デフォルトコンストラクタ
//=============================================================================
CRanking::CRanking()
{
	m_nCntFrame = 0;
}
//=============================================================================
// デストラクタ
//=============================================================================
CRanking::~CRanking()
{

}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CRanking::Init()
{
	int nTotalScore = 0;
	int nSatisfaction = 0;
	int nSelectLevel = CSelect::GetSelectLevel();

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void CRanking::Uninit(void)
{
	//===================================
	//	　　UnLoadの破棄する場所
	//===================================
	//フェードのテクスチャの破棄
	CFade::UnLoad();

	//フェード以外削除
	CScene::NotFadeReleseAll();
}
//=============================================================================
// 更新処理
//=============================================================================
void CRanking::Update(void)
{
	//入力情報
	CInputKeyBoard *pCInputKeyBoard = CManager::GetInput();
	CInputXPad * pXpad = CManager::GetXInput();					//ジョイパットの取得
	CInputMouse *pCInputMouse = CManager::GetInputMouse();

	//サウンドの情報
	CSound *pSound = CManager::GetSound();

	//フェードのポイント
	CFade::FADE pFade = CFade::GetFade();

	if (pXpad->GetALL(1, 0) == true || pCInputKeyBoard->GetKeyboardAny(1) == true || pCInputMouse->GetMouseTrigger(0) == true)
	{//タイトルからゲームへ
	 //フェードが始まったら
		if (pFade == CFade::FADE_NONE)
		{
			//ポーズの選択の決定音
			//pSound->PlaySound(CSound::SOUND_LABEL_SE_TITLE_ENTER);
			CFade::Create(CManager::MODE_TITLE);
		}
	}

}
//=============================================================================
// 描画処理
//=============================================================================
void CRanking::Draw(void)
{
	
}
