//=============================================================================
//
// タイトルカメラ処理 [titlecamera.h]
// Author : 有馬 武志
//
//=============================================================================
#ifndef _TITLECAMERA_H_
#define _TITLECAMERA_H_

#include "main.h"
#include "camerabace.h"

//=====================================================================
//　   前方宣言
//=====================================================================

//=====================================================================
//　   リザルトカメラクラス
//=====================================================================
class CTitleCamera : public CCamera
{
public:
	CTitleCamera();
	~CTitleCamera();

	HRESULT Init(void);
	void Uninit(void);
	void Updata(void);
	void SetCamera();

private:
};
#endif 