//=============================================================================
//
// シェーダー基本処理 [baceshader.cpp]
// Author : 佐藤安純 Sato_Asumi
//
//=============================================================================
#include "baceshader.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CBaceShader::CBaceShader(){}

//=============================================================================
// デストラクタ
//=============================================================================
CBaceShader::~CBaceShader(){}

//=============================================================================
// 初期化処理
//=============================================================================
void CBaceShader::Init(char * FileName)
{
	m_pShader = NULL;

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	//シェーダーの読み込み
	D3DXCreateEffectFromFile(pDevice,
		FileName,
		NULL,						//プリプロセッサーを行う構造体
		NULL,						//インクルード操作を行うインターフェイス
		D3DXSHADER_DEBUG,			//読み込み時のオプション　通常は０でいい
		0,							//シェーダ艦でやり取りする変数　通常は０でいい
		&m_pShader,					//シェーダのポインタ
		NULL);						//エラー情報
}

//=============================================================================
// 終了処理
//=============================================================================
void CBaceShader::Uninit(void)
{
	//シェーダー情報の破棄
	if (m_pShader != NULL)
	{
		m_pShader->Release();
		m_pShader = NULL;
	}
}