//=============================================================================
//
// 背景の処理 [background.cpp]
// Author : shun yokomichi
//
//=============================================================================
#include "scene.h"
#include "scene2D.h"
#include "background.h"
#include "manager.h"
#include "logo.h"
#include "texture.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define POS			(D3DXVECTOR3((SCREEN_WIDTH / 2), (SCREEN_HEIGHT/ 2), 0.0f))			// 位置
#define SIZE		(D3DXVECTOR2((SCREEN_WIDTH / 2), (SCREEN_HEIGHT/ 2)))				// サイズ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数:
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数
//*****************************************************************************

//===============================================================================
//　デフォルトコンストラクタ
//===============================================================================
CBackGround::CBackGround(int nPriorityv) : CScene2D(nPriorityv, CScene::OBJTYPE_2DPOLYGON)//優先優位イニシャライズ
{
	m_size = D3DXVECTOR2(0.0f, 0.0f);
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_nStateFont = 0;
	m_nStateType = 0;
}
//===============================================================================
//　デストラクタ
//===============================================================================
CBackGround::~CBackGround()
{

}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CBackGround::Init(void)
{
	CScene2D::Init();

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CBackGround::Uninit(void)
{
	CScene2D::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CBackGround::Update(void)
{
	//位置の割り当て
	D3DXVECTOR3 pos;
	pos = GetPosition();

	//移動量の割り当て
	//D3DXVECTOR3 move;
	//move = GetMove();

	//位置を更新(移動)
	//pos.x += move.x;
	//pos.y += move.y;

	//ロゴの位置とサイズ
	CScene2D::SetPosSize(pos, m_size);
	//CScene2D::SetMove(move);
	//回転処理
	//CScene2D::SetSpin(pos, m_fAngle, m_fLength, m_rot);
}
//=============================================================================
// 描画処理
//=============================================================================
void CBackGround::Draw(void)
{
	CScene2D::Draw();
}
//===============================================================================
//　クリエイト
//===============================================================================
CBackGround * CBackGround::Create(CTexture::TEXTYPE type)
{
	CBackGround *pBackGround = NULL;
	int nPriorityv = 1;
	if (CTexture::TYPE_PAUSE_BG == type) { nPriorityv = 7; }
	//NULLチェック
	if (pBackGround == NULL)
	{//メモリの動的確保

		pBackGround = new CBackGround(nPriorityv);

		if (pBackGround != NULL)
		{
			//オブジェクトクラスの生成
			pBackGround->Init();
			//テクスチャの割り当て
			pBackGround->BindTexture(*CTexture::GetTexture(type));
			//位置を割り当てる
			pBackGround->SetPosition(POS);
			//サイズの割り当て
			pBackGround->m_size = SIZE;
		}
	}

	return pBackGround;
}