//=============================================================================
//
// 人NPCの処理 [humannpc.cpp]
// Author : 佐藤安純 Sato_Asumi
//
//=============================================================================
#include "humanbace.h"
#include "humannpc.h"
#include "player.h"
#include "game.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define ESCAPE_LENGTH	(200.0f)	//逃げる範囲
#define LENGTH			(500)		//モーション再生距離
#define DRAW_LENGTH		(4000)		//人の描画距離

//=============================================================================
// 生成処理
//=============================================================================
CHumanNPC * CHumanNPC::Create(D3DXVECTOR3 pos, MODEL_TYPE type)
{
	//インスタンスの生成
	CHumanNPC * pHumanNPC;
	pHumanNPC = new CHumanNPC;

	//設定処理
	pHumanNPC->SetModelType(type);

	//初期化処理
	pHumanNPC->Init();
	pHumanNPC->SetPos(pos);		//位置の設定

	return pHumanNPC;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CHumanNPC::CHumanNPC() : CHumanBace(3, CScene::OBJTYPE_HUMANNPC) {}

//=============================================================================
// デストラクタ
//=============================================================================
CHumanNPC::~CHumanNPC() {}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CHumanNPC::Init(void)
{
	CHumanBace::Init();

	//変数の初期化
	m_bEscape = false;			//逃げたかどうか
	m_MotionLength = LENGTH;	//モーションの更新範囲
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CHumanNPC::Uninit(void)
{
	CHumanBace::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CHumanNPC::Update(void)
{
	D3DXVECTOR3 PlayerPos = CGame::GetPlayer()->GetPos();

	//プレイヤーとの距離を求める
	m_fLength = CHumanBace::GetLength(m_pos, PlayerPos);

	//もし一定距離以上だったら描画・更新をしない
	if (m_fLength > DRAW_LENGTH)
	{
		SetDraw(false);	//描画しない
		return;
	}
	else
	{
		SetDraw(true);	//描画する
	}

	if (m_bEscape == false)
	{
		//一定の範囲内なら逃げる処理にする
		if (m_fLength < ESCAPE_LENGTH) { Escape(); }
	}
	else
	{//ニュートラルモーションなら逃げれる状態にする
		if (m_MotionType == MOTION_NEUTRAL)
		{ 
			m_move = VECTOR_ZERO;
			m_bEscape = false; 
		}
	}

	CHumanBace::Update();	//更新処理
}

//=============================================================================
// 描画処理
//=============================================================================
void CHumanNPC::Draw(void)
{
	CHumanBace::Draw(1.0f);
}

//=============================================================================
// 逃げる処理
//=============================================================================
void CHumanNPC::Escape(void)
{
	//逃げる移動処理
	CHumanBace::MoveEscape();

	//逃げるモーションにする
	if (m_MotionType != MOTION_ESCAPE) { SetNextMotion(MOTION_ESCAPE); }

	m_bEscape = true;	//逃げてる状態にする
}